pisofoam-nosecone-iter1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1000;

vertices
(
     (0 3.51 0) 	//0
     (6.62 3.51 0) 	//1
     (6.62 3.51 6.5) 	//2
     (0 3.51 6.5)  	//3
     (0 0 0) 		//4
     (6.62 0 0)		//5	
     (6.62 0 6.5)	//6
     (0 0 6.5)		//7



    
          
  
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (70 70 70) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    back
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    front
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    top
        {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);


// ************************************************************************* //
